case/outputs_steady/openfoam_cases/section_3_x37p7km/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -2 0 0 0 0];
value ( 0 -7.5116 -6.3097 );
